title: Malware triggers RATS
id: 9a50b5bd-5a60-4790-985d-42e26d317f86
status: test
description: Detects suspicious user agent strings used by malware in proxy logs
references:
  - https://eprint.iacr.org/2014/694.pdf
date: 28/8/22
logsource:
  category: proxy
detection:
  selection:
    c-useragent:
        # RATs
      - 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:53.0) Gecko/20100101 Chrome /53.0'    # DargonOK
      - 'Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1)'    # Used by PlugX - base-lining recommended - https://community.rsa.com/thread/185439
      - 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Trident/4.0)'    # Used by PlugX - base-lining recommended - https://community.rsa.com/thread/185439
      - 'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.0; .NET CLR  1.1.4322)'    # Used by PlugX - old - https://goo.gl/Yfjtk5
      - 'HttpBrowser/1.0'    # HTTPBrowser RAT
      - 'Wget/1.9+cvs-stable (Red Hat modified)'    # Dyre / Upatre
       
  condition: selection
fields:
  - ClientIP
  - c-uri
  - c-useragent
falsepositives:
  - rats installed by the malware
level: high
tags:
  - attack.command_and_control
